{
  "posts": [
    {
      "id": 1,
      "title": "Овчинников уйдет с поста Dodo ",
      "body": "В конце декабря прошлого года я объявил коллегам, что через год в конце 2023 года, я передам позицию гендиректора другому человеку. Я не уйду из нашего бизнеса, останусь акционером, членом совета директоров, буду влиять на стратегию и культуру, но больше не буду её действующим лидером.",
      "date": "10.01.2023",
      "img": "./images/1.jpeg"
    },
    {
      "id": 2,
      "title": "Месси и Скалони - чемпионы!",
      "body": "Лионель Скалони играл с Месси на ЧМ, а теперь выстроил вместе с ним чемпионскую команду: в 2021-м они взяли Кубок Америки – после 28-летнего перерыва, а в 2022-м выиграли ЧМ – 36 лет спустя после триумфа Аргентины Марадоны.",
      "date": "09.01.2023",
      "img": "./images/2.jpeg"
    },
    {
      "id": 3,
      "title": "Модель Кано",
      "body": "Модель Кано — неоднозначная модель. У нее есть несколько равнозначных способов расчета, интерпретация тоже скорее субъективна. Но этим она мне и нравится. Она отлично отражает основные свойства того знания, которое мы получаем как исследователи. Она — буквально ода современной философии и спекулятивному реализму.",
      "date": "03.01.2023",
      "img": "./images/3.jpeg"
    },
    {
      "id": 4,
      "title": "Дом Дракона получил Золотой Глобус!",
      "body": "«Дому Дракона» удалось обойти «Лучше звоните Солу», «Корону», «Озарк» и «Разделение». В номинации «Лучшая комедия или мюзикл» победителем стала «Начальная школа Эбботт», оставившая позади «Уэнсдэй» и «Медведя». Первенство среди мини-сериалов досталось «Белому лотосу»",
      "date": "31.12.2022",
      "img": "./images/4.jpeg"
    },
    {
      "id": 5,
      "title": "JavaScript - ТОП 1!",
      "body": "Согласно опросу Global Developer Hiring Landscape Survey report 2017, проведенному Stack Overflow, JavaScript является самым востребованным языком программирования среди веб-разработчиков по всему миру. С момента своего создания в 1995 году JavaScript зарекомендовал себя как оптимальный язык работы с интерфейсами для браузеров и веб-страниц. Благодаря богатому набору библиотек он также обеспечил новые возможности для визуализации. Angular[.js], Ember.js и другие подобные фреймворки предоставили JS необходимую гибкость и возможности.",
      "date": "23.12.2022",
      "img": "./images/5.jpeg"
    },
    {
      "id": 6,
      "title": "Дрейк выпустил двойной альбом",
      "body": "Канадский рэпер Дрейк представил новую пластинку «Scorpion», которая делится на две части. Всего — 25 треков. Среди приглашенных гостей — Джей Зи, Ty Dolla $ign, Static Major и… Майкл Джексон. Песня «Donʼt Matter to Me», появившаяся на альбоме Дрейка, — одна из невыпущенных композиций поп-короля. В треке использованы фрагменты голоса Джексона, а Дрейк поет с ним в унисон.",
      "date": "23.12.2022",
      "img": "./images/6.jpeg"
    },
    {
      "id": 7,
      "title": "Создание React 18",
      "body": "Процесс создания обновления сделали публичным. За прогрессом рабочей группы можно следить на платформе Github Discussions. Посмотреть обсуждения может каждый, но доступ к комментированию и созданию новых тем есть только у команды React и активных участников сообщества (преподаватели, разработчики и авторы библиотек). Благодаря этому появилась возможность заглянуть за кулисы разработки и раньше релиза ознакомиться с изменениями в React 18. Перейдем к ним.",
      "date": "23.12.2022",
      "img": "./images/7.jpeg"
    }
  ],
  "portfolio": [
    {
      "id": 1,
      "type": "Мобильное приложение",
      "title": "Прокат автомобилей",
      "description": "Веб-сервис для аренды автомобилей. Поиск, фильтры, сортировка, пагинация. Возможность выбора разных типов автомобилей (седан, купе. грузовой и тд)...",
      "stack": "Flutter, Java"
    },
    {
      "id": 2,
      "type": "Веб-приложение",
      "title": "Прокат автомобилей",
      "description": "Веб-сервис для аренды автомобилей. Поиск, фильтры, сортировка, пагинация. Возможность выбора разных типов автомобилей (седан, купе. грузовой и тд)...",
      "stack": "React, Redux, SCSS, Node.js, Express"
    },
    {
      "id": 3,
      "type": "Десктоп-приложение",
      "title": "Прокат автомобилей",
      "description": "Веб-сервис для аренды автомобилей. Поиск, фильтры, сортировка, пагинация. Возможность выбора разных типов автомобилей (седан, купе. грузовой и тд)...",
      "stack": "Python"
    },
    {
      "id": 4,
      "type": "Веб-приложение",
      "title": "Видеочат",
      "description": "Необходимо разработать страницу, на которой выводится видео пользователя и уровень громкости микрофона. При заходе на страницу происходит захват видеопотока пользователя и выводится в отдельный блок. Есть иконка, показывающая уровень громкости микрофона. Уровень громкости в иконке меняется в зависимости от громкости звука.",
      "stack": "React, Redux, SCSS, TypeScript"
    },
    {
      "id": 5,
      "type": "Десктоп-приложение",
      "title": "Видеочат",
      "description": "Необходимо разработать страницу, на которой выводится видео пользователя и уровень громкости микрофона. При заходе на страницу происходит захват видеопотока пользователя и выводится в отдельный блок. Есть иконка, показывающая уровень громкости микрофона. Уровень громкости в иконке меняется в зависимости от громкости звука",
      "stack": "Python, Tkinter"
    },
    {
      "id": 6,
      "type": "Мобильное приложение",
      "title": "Видеочат",
      "description": "Необходимо разработать страницу, на которой выводится видео пользователя и уровень громкости микрофона. При заходе на страницу происходит захват видеопотока пользователя и выводится в отдельный блок. Есть иконка, показывающая уровень громкости микрофона. Уровень громкости в иконке меняется в зависимости от громкости звука",
      "stack": "React Native, Swift"
    }
  ]
}